In [2]:
import pandas as pd

In [3]:
data = pd.read_csv('orders.txt')
data

           1  2013-07-25 00:00:00.0  11599           CLOSED
0          2  2013-07-25 00:00:00.0    256  PENDING_PAYMENT
1          3  2013-07-25 00:00:00.0  12111         COMPLETE
2          4  2013-07-25 00:00:00.0   8827           CLOSED
3          5  2013-07-25 00:00:00.0  11318         COMPLETE
4          6  2013-07-25 00:00:00.0   7130         COMPLETE
...      ...                    ...    ...              ...
68877  68879  2014-07-09 00:00:00.0    778         COMPLETE
68878  68880  2014-07-13 00:00:00.0   1117         COMPLETE
68879  68881  2014-07-19 00:00:00.0   2518  PENDING_PAYMENT
68880  68882  2014-07-22 00:00:00.0  10000          ON_HOLD
68881  68883  2014-07-23 00:00:00.0   5533         COMPLETE

[68882 rows x 4 columns]

In [4]:
columns_name = ['order_id', 'order_date', 'order_customer_id', 'order_status' ]

In [5]:
#header =0 tell pandas that at 0 we have header columns
#emp_data = pd.read_csv('sample.txt',header = 0 ,names = columns_name )
order_data = pd.read_csv('orders.txt',names = columns_name )
order_data

       order_id             order_date  order_customer_id     order_status
0             1  2013-07-25 00:00:00.0              11599           CLOSED
1             2  2013-07-25 00:00:00.0                256  PENDING_PAYMENT
2             3  2013-07-25 00:00:00.0              12111         COMPLETE
3             4  2013-07-25 00:00:00.0               8827           CLOSED
4             5  2013-07-25 00:00:00.0              11318         COMPLETE
...         ...                    ...                ...              ...
68878     68879  2014-07-09 00:00:00.0                778         COMPLETE
68879     68880  2014-07-13 00:00:00.0               1117         COMPLETE
68880     68881  2014-07-19 00:00:00.0               2518  PENDING_PAYMENT
68881     68882  2014-07-22 00:00:00.0              10000          ON_HOLD
68882     68883  2014-07-23 00:00:00.0               5533         COMPLETE

[68883 rows x 4 columns]

In [6]:
order_data.columns

Index(['order_id', 'order_date', 'order_customer_id', 'order_status'], dtype='object')

In [7]:
order_data['order_status'].unique()

array(['CLOSED', 'PENDING_PAYMENT', 'COMPLETE', 'PROCESSING',
       'PAYMENT_REVIEW', 'PENDING', 'ON_HOLD', 'CANCELED',
       'SUSPECTED_FRAUD'], dtype=object)

In [8]:
order_data.query('order_status == "CLOSED" or order_status == "ON_HOLD"')

       order_id             order_date  order_customer_id order_status
0             1  2013-07-25 00:00:00.0              11599       CLOSED
3             4  2013-07-25 00:00:00.0               8827       CLOSED
11           12  2013-07-25 00:00:00.0               1837       CLOSED
17           18  2013-07-25 00:00:00.0               1205       CLOSED
23           24  2013-07-25 00:00:00.0              11441       CLOSED
...         ...                    ...                ...          ...
68862     68863  2014-06-16 00:00:00.0               3361       CLOSED
68863     68864  2014-06-18 00:00:00.0               9634      ON_HOLD
68874     68875  2014-07-04 00:00:00.0              10637      ON_HOLD
68876     68877  2014-07-07 00:00:00.0               9692      ON_HOLD
68881     68882  2014-07-22 00:00:00.0              10000      ON_HOLD

[11354 rows x 4 columns]

In [9]:
#emp_data.query('emp_salary > 45000 and emp_location == "Kolkata" or emp_location =="Chennai"')

In [10]:
data = {'Name': ['Alice', 'Bob'], 
        'Age':['24', '25']}

df = pd.DataFrame(data)
df

    Name Age
0  Alice  24
1    Bob  25

In [11]:
df = emp_data
row = [{
    'emp_id' : 11,
    'emp_name': 'Ron',
    'emp_age': 29,
    'emp_location': 'Gurgaon',
    'emp_salary' : 600000
}]

df = df._append(row)

NameError: name 'emp_data' is not defined

In [ ]:
df.head(20)

   emp_id emp_name  emp_age emp_location  emp_salary
0       1    Rohan       25        Delhi       35000
1       2     Amit       30       Mumbai       42000
2       3     Neha       22         Pune       30000
3       4    Priya       28    Bangalore       50000
4       5    Arjun       35      Chennai       48000
5       6    Kavya       27    Hyderabad       39000
6       7    Rahul       31      Kolkata       52000
7       8    Sneha       24       Jaipur       28000
8       9    Ankit       29        Noida       41000
9      10    Pooja       33      Gurgaon       46000
0      11      Ron       29      Gurgaon      600000

In [12]:
df = order_data

In [13]:
df.dtypes

order_id              int64
order_date           object
order_customer_id     int64
order_status         object
dtype: object

In [14]:
count_status = df.groupby('order_status')['order_id'].count().reset_index()
count_status

      order_status  order_id
0         CANCELED      1428
1           CLOSED      7556
2         COMPLETE     22899
3          ON_HOLD      3798
4   PAYMENT_REVIEW       729
5          PENDING      7610
6  PENDING_PAYMENT     15030
7       PROCESSING      8275
8  SUSPECTED_FRAUD      1558

In [15]:
# by using value_count
print(df['order_status'].value_counts())

order_status
COMPLETE           22899
PENDING_PAYMENT    15030
PROCESSING          8275
PENDING             7610
CLOSED              7556
ON_HOLD             3798
SUSPECTED_FRAUD     1558
CANCELED            1428
PAYMENT_REVIEW       729
Name: count, dtype: int64

In [16]:
df['order_date'] = pd.to_datetime(df['order_date'])
df ['Month'] = df['order_date'].dt.to_period('M')
count = df.groupby(['Month', 'order_status'])['order_id'].count().reset_index()
print(count)

       Month     order_status  order_id
0    2013-07         CANCELED        22
1    2013-07           CLOSED       161
2    2013-07         COMPLETE       515
3    2013-07          ON_HOLD        81
4    2013-07   PAYMENT_REVIEW        19
..       ...              ...       ...
112  2014-07   PAYMENT_REVIEW        54
113  2014-07          PENDING       517
114  2014-07  PENDING_PAYMENT       979
115  2014-07       PROCESSING       561
116  2014-07  SUSPECTED_FRAUD       101

[117 rows x 3 columns]

In [17]:
pivot = df.pivot_table(index = 'Month', columns= 'order_status', values= 'order_id', aggfunc= 'count')
print(pivot)

order_status  CANCELED  CLOSED  COMPLETE  ON_HOLD  PAYMENT_REVIEW  PENDING  \
Month
2013-07             22     161       515       81              19      161
2013-08            125     637      1880      300              55      661
2013-09            127     676      1933      315              65      641
2013-10             99     609      1783      288              49      565
2013-11            130     686      2141      362              63      713
2013-12            134     705      1898      305              57      639
2014-01            110     633      1911      365              77      635
2014-02            125     602      1869      308              57      650
2014-03            117     612      1967      323              69      605
2014-04            104     583      1932      333              52      590
2014-05            126     585      1854      309              54      610
2014-06            104     563      1797      281              58      623
2014-07            105     504      1419      228              54      517

order_status  PENDING_PAYMENT  PROCESSING  SUSPECTED_FRAUD
Month
2013-07                   353         188               33
2013-08                  1199         692              131
2013-09                  1260         676              148
2013-10                  1172         662              108
2013-11                  1422         714              150
2013-12                  1343         685              126
2014-01                  1334         712              131
2014-02                  1205         700              119
2014-03                  1233         714              138
2014-04                  1232         719              112
2014-05                  1174         625              130
2014-06                  1124         627              131
2014-07                   979         561              101

In [18]:

df2 = df[['order_id', 'order_status']]
df2.head()

   order_id     order_status
0         1           CLOSED
1         2  PENDING_PAYMENT
2         3         COMPLETE
3         4           CLOSED
4         5         COMPLETE

In [19]:
def get_column_names (schemas, ds_name, sorting_key = 'column_position'):
    column_detail = schemas[ds_name]
    columns = sorted(column_detail,key = lambda col:col[sorting_key])
    return[col['column_name'] for col in columns]

In [20]:
import json
schemas = json.load(open('schemas.json'))

In [21]:
schemas['orders']

[{'column_name': 'order_id', 'data_type': 'integer', 'column_position': 1},
 {'column_name': 'order_date', 'data_type': 'string', 'column_position': 2},
 {'column_name': 'customer_id',
  'data_type': 'timestamp',
  'column_position': 3},
 {'column_name': 'order_status', 'data_type': 'string', 'column_position': 4}]

In [22]:
order_columns = get_column_names(schemas, 'orders')
order_columns

['order_id', 'order_date', 'customer_id', 'order_status']

In [23]:
order_columns = get_column_names(schemas, 'orders')
order_columns

['order_id', 'order_date', 'customer_id', 'order_status']

In [24]:
orders = pd.read_csv('orders.txt', names= order_columns)
orders

       order_id             order_date  customer_id     order_status
0             1  2013-07-25 00:00:00.0        11599           CLOSED
1             2  2013-07-25 00:00:00.0          256  PENDING_PAYMENT
2             3  2013-07-25 00:00:00.0        12111         COMPLETE
3             4  2013-07-25 00:00:00.0         8827           CLOSED
4             5  2013-07-25 00:00:00.0        11318         COMPLETE
...         ...                    ...          ...              ...
68878     68879  2014-07-09 00:00:00.0          778         COMPLETE
68879     68880  2014-07-13 00:00:00.0         1117         COMPLETE
68880     68881  2014-07-19 00:00:00.0         2518  PENDING_PAYMENT
68881     68882  2014-07-22 00:00:00.0        10000          ON_HOLD
68882     68883  2014-07-23 00:00:00.0         5533         COMPLETE

[68883 rows x 4 columns]

In [25]:
schemas.keys()

dict_keys(['departments', 'categories', 'orders', 'products', 'customers', 'order_items'])

In [26]:
customer_columns = get_column_names( schemas, 'customers')
customer_columns

['customer_id',
 'customer_fname',
 'customer_lname',
 'customer_email',
 'customer_password',
 'customer_street',
 'customer_city',
 'customer_state',
 'customer_zipcode']

In [27]:
customers = pd.read_csv('customers.txt',  names= customer_columns)
customers

,customer_id,customer_fname,customer_lname,customer_email,customer_password,customer_street,customer_city,customer_state,customer_zipcode
0,1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521
1,2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126
2,3,Ann,Smith,XXXXXXXXX,XXXXXXXXX,3422 Blue Pioneer Bend,Caguas,PR,725
3,4,Mary,Jones,XXXXXXXXX,XXXXXXXXX,8324 Little Common,San Marcos,CA,92069
4,5,Robert,Hudson,XXXXXXXXX,XXXXXXXXX,10 Crystal River Mall,Caguas,PR,725
...,...,...,...,...,...,...,...,...,...
12430,12431,Mary,Rios,XXXXXXXXX,XXXXXXXXX,1221 Cinder Pines,Kaneohe,HI,96744
12431,12432,Angela,Smith,XXXXXXXXX,XXXXXXXXX,1525 Jagged Barn Highlands,Caguas,PR,725
12432,12433,Benjamin,Garcia,XXXXXXXXX,XXXXXXXXX,5459 Noble Brook Landing,Levittown,NY,11756
12433,12434,Mary,Mills,XXXXXXXXX,XXXXXXXXX,9720 Colonial Parade,Caguas,PR,725
12434,12435,Laura,Horton,XXXXXXXXX,XXXXXXXXX,5736 Honey Downs,Summerville,SC,29483

# join these order and customer tables

In [28]:
# define index 
customers = customers.set_index('customer_id')
orders = orders.set_index('customer_id')

In [29]:
joindf = customers.join(orders, how = 'inner')
joindf

,customer_fname,customer_lname,customer_email,customer_password,customer_street,customer_city,customer_state,customer_zipcode,order_id,order_date,order_status
customer_id,,,,,,,,,,,
1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521,22945,2013-12-13 00:00:00.0,COMPLETE
2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126,15192,2013-10-29 00:00:00.0,PENDING_PAYMENT
2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126,33865,2014-02-18 00:00:00.0,COMPLETE
2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126,57963,2013-08-02 00:00:00.0,ON_HOLD
2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126,67863,2013-11-30 00:00:00.0,COMPLETE
...,...,...,...,...,...,...,...,...,...,...,...
12434,Mary,Mills,XXXXXXXXX,XXXXXXXXX,9720 Colonial Parade,Caguas,PR,725,42915,2014-04-16 00:00:00.0,COMPLETE
12434,Mary,Mills,XXXXXXXXX,XXXXXXXXX,9720 Colonial Parade,Caguas,PR,725,51800,2014-06-14 00:00:00.0,ON_HOLD
12434,Mary,Mills,XXXXXXXXX,XXXXXXXXX,9720 Colonial Parade,Caguas,PR,725,61777,2013-12-26 00:00:00.0,COMPLETE
12435,Laura,Horton,XXXXXXXXX,XXXXXXXXX,5736 Honey Downs,Summerville,SC,29483,41643,2014-04-08 00:00:00.0,PENDING
12435,Laura,Horton,XXXXXXXXX,XXXXXXXXX,5736 Honey Downs,Summerville,SC,29483,61629,2013-12-21 00:00:00.0,CANCELED

In [38]:
customers.index

Index([    1,     2,     3,     4,     5,     6,     7,     8,     9,    10,
       ...
       12426, 12427, 12428, 12429, 12430, 12431, 12432, 12433, 12434, 12435],
      dtype='int64', name='customer_id', length=12435)

In [39]:
joindf2 = customers.join(orders.set_index('customer_id'),  how='inner')

KeyError: "None of ['customer_id'] are in the columns"

In [ ]:
# simple one liner 

joindf2 = customers.join(orders.set_index('customer_id'), on = 'customer_id' , how = 'inner')
# orders.set_index('customer_id') --> set the index for order dataframe 
# while on = 'customer_id' define index for customers dataframe
# else without orders.set_index('customer_id')
# df_left.join(df_right, on='id', how='left')  
# LEFT column  →  RIGHT index  which is incorrect

joindf2

KeyError: "None of ['customer_id'] are in the columns"

In [33]:
# Merge only works if you have common/same column name on both table
mergedf = pd.merge(customers, orders, on= 'customer_id')
mergedf.head()

,customer_fname,customer_lname,customer_email,customer_password,customer_street,customer_city,customer_state,customer_zipcode,order_id,order_date,order_status
customer_id,,,,,,,,,,,
1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521,22945,2013-12-13 00:00:00.0,COMPLETE
2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126,15192,2013-10-29 00:00:00.0,PENDING_PAYMENT
2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126,33865,2014-02-18 00:00:00.0,COMPLETE
2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126,57963,2013-08-02 00:00:00.0,ON_HOLD
2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126,67863,2013-11-30 00:00:00.0,COMPLETE

In [41]:
customers.reset_index()
orders.reset_index()

       customer_id  order_id             order_date     order_status
0            11599         1  2013-07-25 00:00:00.0           CLOSED
1              256         2  2013-07-25 00:00:00.0  PENDING_PAYMENT
2            12111         3  2013-07-25 00:00:00.0         COMPLETE
3             8827         4  2013-07-25 00:00:00.0           CLOSED
4            11318         5  2013-07-25 00:00:00.0         COMPLETE
...            ...       ...                    ...              ...
68878          778     68879  2014-07-09 00:00:00.0         COMPLETE
68879         1117     68880  2014-07-13 00:00:00.0         COMPLETE
68880         2518     68881  2014-07-19 00:00:00.0  PENDING_PAYMENT
68881        10000     68882  2014-07-22 00:00:00.0          ON_HOLD
68882         5533     68883  2014-07-23 00:00:00.0         COMPLETE

[68883 rows x 4 columns]

In [ ]:
mergedf = mergedf.reset_index()

Index(['customer_id', 'customer_fname', 'customer_lname', 'customer_email',
       'customer_password', 'customer_street', 'customer_city',
       'customer_state', 'customer_zipcode', 'order_id', 'order_date',
       'order_status'],
      dtype='object')

In [ ]:
mergedf.columns

In [48]:
mergedf['value'] = mergedf['customer_id'] * mergedf['order_id']
mergedf.head()

,customer_id,customer_fname,customer_lname,customer_email,customer_password,customer_street,customer_city,customer_state,customer_zipcode,order_id,order_date,order_status,value
0,1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521,22945,2013-12-13 00:00:00.0,COMPLETE,22945
1,2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126,15192,2013-10-29 00:00:00.0,PENDING_PAYMENT,30384
2,2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126,33865,2014-02-18 00:00:00.0,COMPLETE,67730
3,2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126,57963,2013-08-02 00:00:00.0,ON_HOLD,115926
4,2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126,67863,2013-11-30 00:00:00.0,COMPLETE,135726

In [52]:
agg = mergedf.groupby('customer_fname')['value'].sum().reset_index()
print(agg.head())

  customer_fname        value
0          Aaron  41558620867
1           Adam  23213466561
2           Alan  21428017059
3         Albert  21340005129
4      Alexander  44789048580

# Sorting in Pandas dataframe

In [53]:
help(orders.sort_values)

Help on method sort_values in module pandas.core.frame:

sort_values(by: 'IndexLabel', *, axis: 'Axis' = 0, ascending: 'bool | list[bool] | tuple[bool, ...]' = True, inplace: 'bool' = False, kind: 'SortKind' = 'quicksort', na_position: 'str' = 'last', ignore_index: 'bool' = False, key: 'ValueKeyFunc | None' = None) -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Sort by the values along either axis.

    Parameters
    ----------
    by : str or list of str
        Name or list of names to sort by.

        - if `axis` is 0 or `'index'` then `by` may contain index
          levels and/or column labels.
        - if `axis` is 1 or `'columns'` then `by` may contain column
          levels and/or index labels.
    axis : "{0 or 'index', 1 or 'columns'}", default 0
         Axis to be sorted.
    ascending : bool or list of bool, default True
         Sort ascending vs. descending. Specify list for multiple sort
         orders.  If this is a list of bools, must match the length of
         the by.
    inplace : bool, default False
         If True, perform operation in-place.
    kind : {'quicksort', 'mergesort', 'heapsort', 'stable'}, default 'quicksort'
         Choice of sorting algorithm. See also :func:`numpy.sort` for more
         information. `mergesort` and `stable` are the only stable algorithms. For
         DataFrames, this option is only applied when sorting on a single
         column or label.
    na_position : {'first', 'last'}, default 'last'
         Puts NaNs at the beginning if `first`; `last` puts NaNs at the
         end.
    ignore_index : bool, default False
         If True, the resulting axis will be labeled 0, 1, …, n - 1.
    key : callable, optional
        Apply the key function to the values
        before sorting. This is similar to the `key` argument in the
        builtin :meth:`sorted` function, with the notable difference that
        this `key` function should be *vectorized*. It should expect a
        ``Series`` and return a Series with the same shape as the input.
        It will be applied to each column in `by` independently.

    Returns
    -------
    DataFrame or None
        DataFrame with sorted values or None if ``inplace=True``.

    See Also
    --------
    DataFrame.sort_index : Sort a DataFrame by the index.
    Series.sort_values : Similar method for a Series.

    Examples
    --------
    >>> df = pd.DataFrame({
    ...     'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    ...     'col2': [2, 1, 9, 8, 7, 4],
    ...     'col3': [0, 1, 9, 4, 2, 3],
    ...     'col4': ['a', 'B', 'c', 'D', 'e', 'F']
    ... })
    >>> df
      col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F

    Sort by col1

    >>> df.sort_values(by=['col1'])
      col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    5    C     4     3    F
    4    D     7     2    e
    3  NaN     8     4    D

    Sort by multiple columns

    >>> df.sort_values(by=['col1', 'col2'])
      col1  col2  col3 col4
    1    A     1     1    B
    0    A     2     0    a
    2    B     9     9    c
    5    C     4     3    F
    4    D     7     2    e
    3  NaN     8     4    D

    Sort Descending

    >>> df.sort_values(by='col1', ascending=False)
      col1  col2  col3 col4
    4    D     7     2    e
    5    C     4     3    F
    2    B     9     9    c
    0    A     2     0    a
    1    A     1     1    B
    3  NaN     8     4    D

    Putting NAs first

    >>> df.sort_values(by='col1', ascending=False, na_position='first')
      col1  col2  col3 col4
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F
    2    B     9     9    c
    0    A     2     0    a
    1    A     1     1    B

    Sorting with a key function

    >>> df.sort_values(by='col4', key=lambda col: col.str.lower())
       col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F

    Natural sort with the key argument,
    using the `natsort <https://github.com/SethMMorton/natsort>` package.

    >>> df = pd.DataFrame({
    ...    "time": ['0hr', '128hr', '72hr', '48hr', '96hr'],
    ...    "value": [10, 20, 30, 40, 50]
    ... })
    >>> df
        time  value
    0    0hr     10
    1  128hr     20
    2   72hr     30
    3   48hr     40
    4   96hr     50
    >>> from natsort import index_natsorted
    >>> df.sort_values(
    ...     by="time",
    ...     key=lambda x: np.argsort(index_natsorted(df["time"]))
    ... )
        time  value
    0    0hr     10
    3   48hr     40
    2   72hr     30
    4   96hr     50
    1  128hr     20

In [ ]:
orders.sort_values('customer_id',)

             order_id             order_date     order_status
customer_id
1               22945  2013-12-13 00:00:00.0         COMPLETE
2               57963  2013-08-02 00:00:00.0          ON_HOLD
2               67863  2013-11-30 00:00:00.0         COMPLETE
2               15192  2013-10-29 00:00:00.0  PENDING_PAYMENT
2               33865  2014-02-18 00:00:00.0         COMPLETE
...               ...                    ...              ...
12434           42915  2014-04-16 00:00:00.0         COMPLETE
12434            4799  2013-08-23 00:00:00.0  PENDING_PAYMENT
12434           13544  2013-10-16 00:00:00.0          PENDING
12435           41643  2014-04-08 00:00:00.0          PENDING
12435           61629  2013-12-21 00:00:00.0         CANCELED

[68883 rows x 3 columns]

In [56]:
orders.sort_values(['customer_id', 'order_date'])

             order_id             order_date     order_status
customer_id
1               22945  2013-12-13 00:00:00.0         COMPLETE
2               57963  2013-08-02 00:00:00.0          ON_HOLD
2               15192  2013-10-29 00:00:00.0  PENDING_PAYMENT
2               67863  2013-11-30 00:00:00.0         COMPLETE
2               33865  2014-02-18 00:00:00.0         COMPLETE
...               ...                    ...              ...
12434           61777  2013-12-26 00:00:00.0         COMPLETE
12434           42915  2014-04-16 00:00:00.0         COMPLETE
12434           51800  2014-06-14 00:00:00.0          ON_HOLD
12435           61629  2013-12-21 00:00:00.0         CANCELED
12435           41643  2014-04-08 00:00:00.0          PENDING

[68883 rows x 3 columns]

In [59]:
orders.sort_values(by= ['customer_id', 'order_date'], ascending= False)

             order_id             order_date     order_status
customer_id
12435           41643  2014-04-08 00:00:00.0          PENDING
12435           61629  2013-12-21 00:00:00.0         CANCELED
12434           51800  2014-06-14 00:00:00.0          ON_HOLD
12434           42915  2014-04-16 00:00:00.0         COMPLETE
12434           61777  2013-12-26 00:00:00.0         COMPLETE
...               ...                    ...              ...
2               33865  2014-02-18 00:00:00.0         COMPLETE
2               67863  2013-11-30 00:00:00.0         COMPLETE
2               15192  2013-10-29 00:00:00.0  PENDING_PAYMENT
2               57963  2013-08-02 00:00:00.0          ON_HOLD
1               22945  2013-12-13 00:00:00.0         COMPLETE

[68883 rows x 3 columns]

# Storing dataframe into CSV file

In [60]:
df = orders.sort_values(by= ['customer_id', 'order_date'], ascending= False)
df

             order_id             order_date     order_status
customer_id
12435           41643  2014-04-08 00:00:00.0          PENDING
12435           61629  2013-12-21 00:00:00.0         CANCELED
12434           51800  2014-06-14 00:00:00.0          ON_HOLD
12434           42915  2014-04-16 00:00:00.0         COMPLETE
12434           61777  2013-12-26 00:00:00.0         COMPLETE
...               ...                    ...              ...
2               33865  2014-02-18 00:00:00.0         COMPLETE
2               67863  2013-11-30 00:00:00.0         COMPLETE
2               15192  2013-10-29 00:00:00.0  PENDING_PAYMENT
2               57963  2013-08-02 00:00:00.0          ON_HOLD
1               22945  2013-12-13 00:00:00.0         COMPLETE

[68883 rows x 3 columns]

In [64]:
df.to_csv('sorted_dataframe.csv', index= False)

In [65]:
df.to_json('sorted_dataframe.json', orient= 'records' , lines= True)